# Homework---4



## Условие задачи
Написать программу для решения задачи. 

## 1. Алгоритм 

### Алгоритм
1. **Начало**
2. Задать исходные данные:
   - `A` — Номер первой команды
   - `B` — Номер второй команды
3.Условие для права первого хода:
   -  if ((A % 2 == 0) && (B % 2 != 0))
4. Условие, если не выполняется предыдущее:
   - ((A % 2 != 0) && (B % 2 == 0))
5. Вывод результатов первого хода.
6. **Конец**



## 2. Реализация программы

```
#define _CRT_SECURE_NO_WARNINGS 
#include <stdio.h>
#include <locale.h>     

int main() {
    setlocale(LC_ALL, "RUS");
    int A, B;

    // Шаг 1: Ввод номеров команд
    printf("Введите номер команды A: ");
    scanf("%d", &A);
    printf("Введите номер команды B: ");
    scanf("%d", &B);

    // Шаг 2: Проверка условия и определение победителя
    if ((A % 2 == 0) && (B % 2 != 0)) {
        // Команда A четная, команда B нечетная
        printf("Право первого хода получает команда A!\n");
    }
    else if ((A % 2 != 0) && (B % 2 == 0)) {
        // Команда A нечетная, команда B четная
        printf("Право первого хода получает команда B!\n");
    }
    else {
        // Оба четные или оба нечетные
        printf("Право первого хода определяется другими правилами\n");
    }

    // Шаг 3: Завершение программы
    return 0;
}

```

## 3. Результаты работы программы

```
Введите номер команды A: 15
Введите номер команды B: 26
Право первого хода получает команда B!
```

## 4. Информация о разработчике

Прохорова Виктория, бТИИ-251
